package HW5;

//Задание 1. В качестве задачи предлагается решить классическую задачу про обедающих философов
//Условие:
//● Есть пять философов (потоки), которые могут либо обедать (выполнение кода) либо размышлять (ожидание).
//● Каждый философ должен пообедать три раза. Каждый прием пищи длиться 500 миллисекунд
//● После каждого приема пищи философ должен размышлять
//● Не должно возникнуть общей блокировки
//● Философы не должны есть больше одного раза подряд
//

//1. Пять безмолвных философов сидят вокруг круглого стола, перед каждым философом стоит тарелка спагетти.
//2. Вилки лежат на столе между каждой парой ближайших философов.
//3. Каждый философ может либо есть, либо размышлять.
//4. Философ может есть только тогда, когда держит две вилки — взятую справа и слева.
//5. Философ не может есть два раза подряд, не прервавшись на размышления (можно не учитывать)
//
//Описать в виде кода такую ситуацию. Каждый философ должен поесть три раза
public class Main {
}
